////给定一个包含非负整数的 m x n 网格，请找出一条从左上角到右下角的路径，使得路径上的数字总和为最小。
////
//// 说明：每次只能向下或者向右移动一步。
////
//// 示例:
////
//// 输入:
////[
////  [1,3,1],
////  [1,5,1],
////  [4,2,1]
////]
////输出: 7
////解释: 因为路径 1→3→1→1→1 的总和最小。
////
//// Related Topics 数组 动态规划
//// 👍 524 👎 0
//
//
//package com.gxgeek.leetcode.editor.cn;
////Java：最小路径和
//////给定一个包含非负整数的 m x n 网格，请找出一条从左上角到右下角的路径，使得路径上的数字总和为最小。
////
//// 说明：每次只能向下或者向右移动一步。
////
//// 示例:
////
//// 输入:
////[
////  [1,3,1],
////  [1,5,1],
////  [4,2,1]
////]
////输出: 7
////解释: 因为路径 1→3→1→1→1 的总和最小。
////
//// Related Topics 数组 动态规划
//// 👍 524 👎 0
//
//public class GX_64_MinimumPathSum{
//    public static void main(String[] args) {
//        Solution solution = new GX_64_MinimumPathSum().new Solution();
//        // TO TEST
//    }
//    //leetcode submit region begin(Prohibit modification and deletion)
//class Solution {
//    public int minPathSum(int[][] grid) {
//
//
//
//
//    }
//}
////leetcode submit region end(Prohibit modification and deletion)
//
//}
